{
    "terms": ["红石火把", "红石线", "红石中继器", "红石比较器", "逻辑门", "二进制", "全加器", "减法器",
            "红石时钟", "脉冲发生器", "单稳态", "双稳态", "T触发器", "RS触发器", "D触发器", "计数器",
            "分频器", "解码器", "编码器", "多路复用器", "红石计算机",
            "自动农场", "捕鱼机", "刷怪塔", "经验农场", "红石矿车", "自动熔炉", "物品分类", "自动门",
            "隐藏门", "红石电梯", "水流控制", "岩浆流控制", "自动化养鸡", "骨粉自动施", "村民交易",
            "红石存储器", "红石锁存器", "寄存器", "移位寄存器", "随机存取", "只读存储器", "可编程逻辑", "红石硬盘",
            "TNT炮", "飞沙炮", "水流炮", "凋零炮", "自动填装", "连发机构", "瞄准系统", "红石炮塔",
            "防御系统",
            "模拟信号", "信号强度", "衰减器", "增强器", "红石压力", "测重压力", "模拟时钟", "模拟传感",
            "音量控制", "红石调光",
            "活塞", "粘性活塞", "机械臂", "红石机械", "自动门机", "隐藏楼梯", "红石飞行", "红石车辆",
            "红石船", "飞行器控制", "计数器"],
    "weight_map": {
        "global":[
            {"keyword": "服务器", "weight": 0},
            {"keyword": "砰砰军团", "weight": 0},
            {"keyword": "红石雕", "weight": 0},
            {"keyword": "金红石", "weight": 0},
            {"keyword": "禹州", "weight": 0},
            {"keyword": "塔罗", "weight": 0},
            {"keyword": "红石林", "weight": 0},
            {"keyword": "峡谷", "weight": 0},
            {"keyword": "红石谷", "weight": 0},
            {"keyword": "红石公园", "weight": 0},
            {"keyword": "游戏实况", "weight": 0},
            {"keyword": "实况", "weight": 0},
            {"keyword": "湖南", "weight": 0},
            {"keyword": "机械动力", "weight": 0},
            {"keyword": "模组", "weight": 0},
            {"keyword": "MOD", "weight": 0},
            {"keyword": "红石峡", "weight": 0},
            {"keyword": "命运", "weight": 0},
            {"keyword": "连麦", "weight": 0},
            {"keyword": "指令", "weight": 0.01},
            {"keyword": "无指令", "weight": 200},
            {"keyword": "生存", "weight": 0.3},
            {"keyword": "生电", "weight": 1.5},
            {"keyword": "数电", "weight": 1.5},
            {"keyword": "模电", "weight": 1.5},
            {"keyword": "械电", "weight": 1.5},
            {"keyword": "储电", "weight": 1.5},
            {"keyword": "炮电", "weight": 1.5},
            {"keyword": "音乐", "weight": 0},
            {"keyword": "红石电路", "weight": 2},
            {"keyword": "红石科技", "weight": 2},
            {"keyword": "沙雕红石", "weight": 2},
            {"keyword": "教程", "weight": 2},
            {"keyword": "陷阱", "weight": 2},
            {"keyword": "三向", "weight": 2},
            {"keyword": "树场", "weight": 2},
            {"keyword": "场", "weight": 2},
            {"keyword": "MCBE", "weight": 2},
            {"keyword": "MCJE", "weight": 2},
            {"keyword": "BE", "weight": 2},
            {"keyword": "JE", "weight": 2},
            {"keyword": "基岩", "weight": 2},
            {"keyword": "JAVA", "weight": 2},
            {"keyword": "网易", "weight": 2},
            {"keyword": "求助", "weight": 0},
            {"keyword": "光遇", "weight": 0}
        ],
        "special": [
            {
                "keyword": "红石",
                "title": [1, 1],
                "description": [1.3, 1],
                "tags" : [1, 0.9]
            }
        ]
    }
}