{
    "terms": ["红石火把", "红石线", "红石中继器", "红石比较器", "逻辑门", "二进制", "全加器", "减法器",
            "红石时钟", "脉冲发生器", "单稳态", "双稳态", "T触发器", "RS触发器", "D触发器", "计数器",
            "分频器", "解码器", "编码器", "多路复用器", "红石计算机",
            "农场", "刷怪塔", "经验农场", "红石矿车", "自动熔炉", "物品分类", "自动门",
            "隐藏门", "红石电梯", "水流", "村民交易",
            "红石存储器", "红石锁存器", "寄存器", "移位寄存器", "只读存储器", "可编程逻辑", "红石硬盘",
            "TNT炮", "凋零炮", "红石炮塔",
            "活塞", "粘性活塞", "机械臂", "红石机械", "活塞门", "飞行器", "计数器", "打字机", "战舰", "计算机", "计算器",
            "生电", "数电", "模电", "械电", "储电", "炮电"
    ],
    "blacklist": [
        "服务器", "砰砰军团", "红石雕", "金红石", "禹州", "塔罗", "红石林", "峡谷", "红石谷", "红石公园", "游戏实况", "实况",
        "湖南", "机械动力", "模组", "MOD", "红石峡", "命运", "连麦", "音乐", "明日方舟", "神秘时代", "求助", "光遇"
    ],
    "weight_map": {
        "global":[
            {"keyword": "指令", "weight": 0.01},
            {"keyword": "无指令", "weight": 200},
            {"keyword": "生存", "weight": 0.3},
            {"keyword": "红石电路", "weight": 2},
            {"keyword": "红石科技", "weight": 2},
            {"keyword": "沙雕红石", "weight": 2},
            {"keyword": "教程", "weight": 2},
            {"keyword": "陷阱", "weight": 2},
            {"keyword": "三向", "weight": 2},
            {"keyword": "树场", "weight": 2},
            {"keyword": "场", "weight": 2},
            {"keyword": "MCBE", "weight": 2},
            {"keyword": "MCJE", "weight": 2},
            {"keyword": "BE", "weight": 2},
            {"keyword": "JE", "weight": 2},
            {"keyword": "基岩", "weight": 2},
            {"keyword": "JAVA", "weight": 2},
            {"keyword": "网易", "weight": 2}
        ],
        "special": [
            {
                "keyword": "红石",
                "title": [1, 1],
                "description": [1.3, 1],
                "tags" : [1, 0.9]
            }
        ]
    }
}